$(function(){
//省市二级联动
    var province=["北京市","天津市","上海市","重庆市","河北省","山西省","内蒙古","辽宁省","吉林省","黑龙江省","江苏省","浙江省","安徽省","福建省","江西省","山东省","河南省","湖北省","湖南省","广东省","广西","海南省","四川省","贵州省","云南省","西藏","陕西省","甘肃省","青海省","宁夏","新疆","香港","澳门","台湾省"];
    var school=[["北京大学","中国人民大学","清华大学","北京交通大学","北京科技大学","中国石油大学（北京）","中国矿业大学（北京）","中国地质大学（北京）","北京邮电大学","华北电力大学","北京化工大学","中国农业大学","北京林业大学","北京师范大学","北京外国语大学","北京语言大学","中央财经大学","中国政法大学","北京电影学院"],
              ["南开大学","天津大学","中国民航大学","天津工业大学","天津科技大学","天津理工大学","天津师范大学","天津体育学院","天津音乐学院","天津美术学院"],
              ["复旦大学","同济大学","上海交通大学","华东理工大学","东华大学","华东师范大学","上海财经大学","上海大学","上海戏剧学院"],
              ["重庆大学","西南大学","重庆交通大学","重庆邮电大学","重庆师范大学","长江师范学院"], 
              ["河北大学","河北工业大学","燕山大学","华北理工大学","河北科技大学","河北工程大学"],
              ["山西大学","太原理工大学","中北大学","太原科技大学","山西农业大学","山西医科大学","山西大同大学"],
              ["内蒙古大学","内蒙古科技大学","内蒙古民族大学","内蒙古工业大学","内蒙古农业大学"],
              ["大连理工大学","东北大学","大连海事大学","辽宁大学","大连大学","沈阳大学"],
              ["吉林大学","东北师范大学","延边大学","北华大学","长春大学","长春理工大学","长春工业大学"],
              ["东北林业大学","哈尔滨工业大学","哈尔滨工程大学","黑龙江大学","佳木斯大学","齐齐哈尔大学"], 
              ["南京大学","东南大学","中国矿业大学","河海大学","江南大学","南京农业大学","中国药科大学","南京理工大学","南京航空航天大学","江苏大学"],
              ["浙江大学","宁波大学","浙江工业大学","杭州电子科技大学","浙江理工大学","浙江师范大学","杭州师范大学"], 
              ["合肥工业大学","中国科学技术大学","安徽大学","安徽理工大学","安徽工业大学","安徽农业大学","安徽医科大学","安徽师范大学","安徽财经大学"],
              ["厦门大学","华侨大学","福建农林大学","集美大学","福州大学","仰恩大学","福建师范大学","福建工程学院","三明学院"],
              ["南昌大学","江西理工大学","华东交通大学","江西农业大学","江西师范大学","江西财经大学","东华理工大学","南昌航空大学","井冈山大学"],
              ["山东大学","中国海洋大学","中国石油大学（华东）","青岛大学","山东科技大学","山东理工大学","聊城大学","青岛科技大学","济南大学"],
              ["郑州大学","河南大学","河南科技大学","河南理工大学","河南工业大学","河南农业大学","河南师范大学","河南财经政法大学"],
              ["武汉大学","华中科技大学","中南财经政法大学","武汉理工大学","中国地质大学（武汉）","华中农业大学","华中师范大学","中南民族大学","江汉大学","武汉纺织大学","湖北工程学院","湖北警官学院","湖北美术学院","武汉音乐学院"],
              ["中南大学","国防科学技术大学","湖南大学","长沙理工大学","湖南师范大学","湖南科技大学","湘潭大学"],
              ["中山大学","华南理工大学","暨南大学","汕头大学","深圳大学","南方科技大学","广东工业大学","广东海洋大学","广州大学"],
              ["广西大学","桂林电子科技大学","广西医科大学","广西师范大学","广西民族大学","桂林理工大学"], 
              ["海南大学","海南师范大学","海南医学院"],
              ["四川大学","西南交通大学","电子科技大学","西南财经大学","西南民族大学","成都理工大学","西华大学","西南科技大学","成都大学"],
              ["贵州大学","贵州师范大学","贵州财经大学","贵州民族大学","贵州医科大学","遵义医学院"], 
              ["云南大学","昆明理工大学","云南农业大学","云南师范大学","云南财经大学","云南民族大学","西南林业大学"],
              ["西藏大学","西藏民族大学","西藏藏医学院"], 
              ["西安交通大学","长安大学","西安电子科技大学","西北农林科技大学","陕西师范大学","西北工业大学","西北大学","延安大学","西安石油大学","西安工程大学","渭南师范学院"], 
              ["兰州大学","西北民族大学","兰州理工大学","兰州交通大学","甘肃农业大学","西北师范大学","兰州财经大学"], 
              ["青海大学","青海师范大学","青海民族大学"],
              ["宁夏大学","北方民族大学","宁夏医科大学","宁夏理工学院","宁夏师范学院"],
              ["新疆大学","石河子大学","新疆农业大学","塔里木大学","新疆医科大学","新疆师范大学"],
              ["香港中文大学","香港城市大学","香港大学","香港理工大学"],
              ["澳门大学","澳门理工大学","澳门科技大学","澳门城市大学"],
              ["台湾中央大学","台湾清华大学","交通大学","台湾大学","嘉义大学","元智大学"]]; 

    for(var i=0;i<province.length;i++){
    	$("select[name='province']").append("<option value='"+province[i]+"'>" +province[i]+ "</option>");
    }
    $("select[name='province']").change(function(){
    	$("select[name='school']").empty();
    	$("select[name='school']").append("<option value=''>" +"请选择学校"+ "</option>");
         var province=$("select[name='province']").val();
    	$("select[name='province'] option").each(function(i){
    	if($(this).attr("value")==province){
    			for(var j=0;j<school[i-1].length;j++){
    			$("select[name='school']").append("<option value='"+school[i-1][j]+"'>" +school[i-1][j]+ "</option>");
    			}
    		}
    	})    	
    })
})